import Button from 'react-bootstrap/Button'
import Modal from 'react-bootstrap/Modal'


type Props = {
    show: boolean
    handleClose: () => void
}

export default function CvModal({ show, handleClose }: Props) {
    return (
        <Modal show={show} onHide={handleClose} size="lg">
            <Modal.Header closeButton>
                <Modal.Title>ΠΛΗΡΕΣ ΒΙΟΓΡΑΦΙΚΟ</Modal.Title>
            </Modal.Header>
            <Modal.Body>

        
                <p style={{fontSize: '25px'}} className='dark_primary_text'>

                    Ονομάζομαι <strong>Έβελυν Πατσιούρα</strong>, είμαι Ψυχολόγος και κάτοχος άδειας ασκήσεως επαγγέλματος (2572/17-06-2020).
                    Απέκτησα πτυχίο Ψυχολογίας από το <strong>University of East London</strong>.
                    Στα πλαίσια των προπτυχιακών μου σπουδών ολοκλήρωσα πρακτική άσκηση στην
                    
                    <br></br>
                    <br></br>
                    
                    <strong>Ελληνική Εταιρία Νόσου Alzheimer </strong>
                    όπου είχα την ευκαιρία να παρακολουθήσω και να συμμετάσχω σε προγράμματα μη φαρμακευτικών παρεμβάσεων
                    για την αντιμετώπιση ήπιων και μειζόνων νοητικών διαταραχών, σε υποστηρικτικά προγράμματα
                    για τους περιθάλποντες και στη χορήγηση νευροψυχολογικών δοκιμασιών για την άνοια.
                    Στη συνέχεια, ακολούθησα τριετούς φοίτησης μεταπτυχιακές σπουδές για την απόκτηση του μεταπτυχιακού ΜΑ Counselling & Psychotherapy, 
                    το οποίο παρείχε εκπαίδευση στο συνθετικό μοντέλο ψυχοθεραπείας, 
                    βιωματικές ομάδες προσωπικής ανάπτυξης και εποπτευόμενη κλινική πρακτική. 
                    Επί του παρόντος, ολοκληρώνω την εξειδίκευσή μου στη <strong>Γνωστική Συμπεριφορική Θεραπεία</strong> 
                    παρακολουθώντας το πιστοποιημένο εκπαιδευτικό πρόγραμμα που παρέχει η Ελληνική Εταιρεία Έρευνας της Συμπεριφοράς 
                    σύμφωνα με τα κριτήρια της <strong>ABCT (European Association for Behavioural and Cognitive Therapies)</strong>E. 
                    
                    <br></br>
                    <br></br>

                    Ως Ψυχολόγος έχω εργαστεί με ενήλικες παρέχοντας υπηρεσίες βραχείας ψυχοθεραπείας και συμβουλευτικής 
                    μέσω διαδικτύου σε πρόγραμμα του υπουργείου υγείας σε συνεργασία με εταιρεία ψυχικής υγείας στη <strong>Θεσσαλονίκη</strong>.

                    <br></br>
                    <br></br>

                    Η κλινική μου εμπειρία συνεχίστηκε σε <strong>Μονάδα Φροντίδας Ηλικιωμένων</strong> όπου είχα την ευκαιρία να εργαστώ με ηλικιωμένους 
                    που αντιμετώπιζαν νευροεκφυλιστικές ασθένειες παρέχοντας ψυχοκοινωνική υποστήριξη στους ίδιους 
                    και στις οικογένειές τους. Επιπλέον, πραγματοποιούσα ομάδες νοητικής ενδυνάμωσης, 
                    συνεδρίες νευροψυχολογικής αξιολόγησης των ενοίκων καθώς και ομάδες υποστήριξης του προσωπικού. 
                    
                    <br></br>
                    <br></br>

                    Τον τελευταίο ενάμιση χρόνο εργάζομαι σε κέντρο ειδικών θεραπειών όπου παρέχω συμβουλευτική γονέων 
                    και αναλαμβάνω περιπτώσεις παιδιών με <strong>αναπτυξιακά, συναισθηματικά, συμπεριφορικά ζητήματα 
                    και μαθησιακές δυσκολίες</strong>. 

                    <br></br>
                    <br></br>

                    Παράλληλα στα πλαίσια της συνεχούς επιμόρφωσης έχω παρακολουθήσει πλήθος σεμιναρίων με θέμα 
                    τη <strong>διαχείριση του πένθους</strong>, τη <strong>διαταραχή μετατραυματικού stress</strong>, 
                    τη <strong>διαταραχή ελλειμματικής προσοχής</strong> και υπερκινητικότητας, το <strong>attachment parenting</strong>, 
                    τη συναισθηματική υπερφαγία καθώς και μία ευρεία θεματικών βασισμένη στις αρχές 
                    του γνωσιακού συμπεριφορικού μοντέλου.  

                    <br></br>
                    <br></br>

                    Από το 2025 εργάζομαι επίσης ιδιωτικά αναλαμβάνοντας διαδικτυακά και <strong>δια ζώσης συνεδρίες</strong> με έφηβους και ενήλικες.

                </p>
            </Modal.Body>
            <Modal.Footer>
                <Button className="modalButton" onClick={handleClose}>
                    Κλείσιμο
                </Button>

            </Modal.Footer>
        </Modal>
    )
}