import Header from "@/app/components/Header"

import { Container, Stack } from "react-bootstrap"

type ServiceType = {
    icon: string
    title: string
    body: string
}


export default function Services() {
    const services: ServiceType[] = [
        {
            icon: 'bi bi-person',
            title: "ΑΤΟΜΙΚΗ ΨΥΧΟΘΕΡΑΠΕΙΑ",
            body: "Η ατομική ψυχοθεραπεία απευθύνεται σε ανθρώπους που αντιμετωπίζουν ψυχολογικές δυσκολίες και καθημερινές προκλήσεις με αποτέλεσμα να επηρεάζεται σε σημαντικό βαθμό η λειτουργικότητά τους. Μέσα από τη δημιουργία ενός κλίματος ασφάλειας, εμπιστευτικότητας και αμέριστης αποδοχής ο θεραπευόμενος ενθαρρύνεται να διερευνήσει σκέψεις, συναισθήματα και συμπεριφορές που επηρεάζουν δυσμενώς την καθημερινότητα και την ψυχική ευεξία. Η διαδικασία της ψυχοθεραπείας στοχεύει στην εκμάθηση νέων τρόπων σκέψεων και συμπεριφοράς όπως και στην απόκτηση κατάλληλων δεξιοτήτων που θα οδηγήσουν σε μία περισσότερο ικανοποιητική ζωή. Η ατομική ψυχοθεραπεία μπορεί να βοηθήσει στη διαχείριση διαφόρων ψυχολογικών ζητημάτων όπως είναι οι αγχώδεις διαταραχές (άγχος, κρίσεις πανικού, φοβίες, ιδεοψυχαναγκαστική διαταραχή), διαταραχές διάθεσης (κατάθλιψη), διαταραχές προσωπικότητας, δυσκολία στις διαπροσωπικές σχέσεις, διατροφικές διαταραχές, ψυχοσωματικά προβλήματα, κρίσεις ζωής – μεταβάσεις – πένθος, χαμηλή αυτοεκτίμηση και προσωπική ανάπτυξη."
        },
        {
            icon: 'bi bi-headset',
            title: "ΟNLINE ΘΕΡΑΠΕΙΑ ΚΑΙ ΣΥΜΒΟΥΛΕΥΤΙΚΗ",
            body: "Οι διαδικτυακές συνεδρίες αποτελούν μία ασφαλή επιλογή για ανθρώπους που κατοικούν σε απομακρυσμένες περιοχές με περιορισμένη ή ελλιπή  πρόσβαση σε υπηρεσίες ψυχικής υγείας, για εκείνους που λόγω της καθημερινότητάς τους ή προβλημάτων υγείας δυσκολεύονται να μετακινηθούν με ασφάλεια ή για όλους εκείνους που επιθυμούν να πραγματοποιούν τις συνεδρίες από το δικό τους χώρο. Όπως και στη διά ζώσης θεραπεία, ισχύουν οι ίδιοι όροι συνεργασίας. Βασική προϋπόθεση για τη ομαλή διεξαγωγή των συνεδριών διαδικτυακά είναι η σταθερή σύνδεση στο διαδίκτυο και η εξασφάλιση ενός ήρεμου και ιδιωτικού περιβάλλοντος χωρίς την παρουσία ή παρεμβολή άλλων ανθρώπων ώστε να μπορείτε να μιλήσετε ελεύθερα για ότι σας απασχολεί."
        },
        {
            icon: 'bi bi-lightbulb',
            title: "ΓΝΩΣΤΙΚΗ ΣΥΜΠΕΡΙΦΟΡΙΚΗ ΘΕΡΑΠΕΙΑ",
            body: "Η Γνωστική Συμπεριφορική Θεραπεία αποτελεί μία ολοκληρωμένη ψυχολογική θεραπεία η οποία έχει αξιολογηθεί εκτεταμένα για την αποτελεσματικότητά της σε ένα ευρύ φάσμα ψυχολογικών δυσκολιών. Το συγκεκριμένο μοντέλο προτείνει πως ο δυσλειτουργικός τρόπος σκέψης που επηρεάζει τη διάθεση και τη συμπεριφορά του ατόμου είναι κοινό στοιχείο σε όλες τις ψυχολογικές δυσκολίες. Επομένως, όταν οι άνθρωποι μαθαίνουν να αξιολογούν πιο ρεαλιστικά τις σκέψεις τους βλέπουν άμεση βελτίωση στη συναισθηματική τους κατάσταση και στη συμπεριφορά τους. Το συγκεκριμένο μοντέλο προτείνει πως η αιτία της ψυχολογικής δυσφορίας δεν είναι τα ίδια καθεαυτά γεγονότα αλλά ο τρόπος με τον οποίο οι άνθρωποι έχουν μάθει να σκέφτονται γύρω από αυτά. Ο δυσλειτουργικός τρόπος σκέψης που μεταφράζεται σε πεποιθήσεις για τον εαυτό, τον κόσμο και το μέλλον επηρεάζει με τη σειρά του τη συναισθηματική λειτουργία και τη συμπεριφορά των ανθρώπων οδηγώντας πολλές φορές σε ψυχολογικές δυσκολίες και αδιέξοδα. Η γνωστική συμπεριφορική θεραπεία αντιμετωπίζει αυτές τις σκέψεις όχι ως αντικειμενικά γεγονότα αλλά ως υπό εξέταση ιδέες που χρειάζεται να αξιολογηθούν ως προς την εγκυρότητά τους, αξιοποιώντας μία ποικιλία τεχνικών. Κατά τη διάρκεια της θεραπευτικής διαδικασίας ο θεραπευτής και ο θεραπευόμενος συνεργάζονται στενά για τη διαμόρφωση κοινών στόχων και την υλοποίησή τους. Οι συνεδρίες είναι δομημένες, προσανατολισμένες στους στόχους και επικεντρωμένες στα προβλήματα του θεραπευόμενου. Η ψυχοεκπαίδευση κατέχει επίσης κεντρικό ρόλο καθώς υποστηρίζει το άτομο στην ενημέρωση και εκπαίδευση κατάλληλων δεξιοτήτων ώστε να μπορέσει στο μέλλον και μετά τον τερματισμό της θεραπείας να διαχειρίζεται αποτελεσματικά τις καθημερινές προκλήσεις. "
        },
    ]

    return (
        <main>

            <Header />



            <section className="primary_bg py-5 px-md-0 px-3">
                <Container>

                    <Stack gap={4}>


                        {services
                            .map(({ icon, title, body }: ServiceType) => (

                                <div key={`${title}-${body}`} className='d-flex flex-column gap-3 justify-content-center'>
                                    <div className="d-flex gap-3 align-items-center">

                                        <div className='serviceIcon'>
                                            <i className={icon} />
                                        </div>

                                        <h3 className='white-text m-0'>{title}</h3>
                                    </div>


                                    <p className='white-text' style={{ fontSize: "25px" }}>{body}</p>


                                </div>
                            ))}
                    </Stack>



                </Container>
            </section>


        </main>
    )
}